# ViewportAttrLabelTag Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewportAttrLabelTag Property
ParameterTypeId Class See Also
---
"Title"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewportAttrLabelTag { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewportAttrLabelTag As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewportAttrLabelTag {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace